
#+title: Emacs Configuration
** Main Configuration
The principal configuration block sets up directories and org-capture templates.
#+begin_src elisp
(defvar +info-dir "~/Documents/personal/notes"
  "The root for all notes, calendars, agendas, todos, attachments,
and bibliographies.")
(use-package! org
  :defer t
  :init
  (setq org-directory (expand-file-name "content" +info-dir)
        org-modules   '(ol-bibtex ol-bookmark ol-docview
                        ol-doi org-checklist org-id
                        org-tempo))

  (setq
   org-roam-directory         (expand-file-name "roam" org-directory)
   org-roam-dailies-directory "journal/"
   org-roam-mode-sections     '((org-roam-backlinks-section :unique t)
                                org-roam-reflinks-section)
   org-roam-graph-executable  "neato"
   org-roam-capture-templates
   '(("d" "default" plain "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                         "#+title: ${title}")
      :unnarrowed t)
     ("s" "sensitive" plain "%?"
      :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org.gpg"
                         "#+title: ${title}\n")
      :unnarrowed t))
   org-roam-dailies-capture-templates
   '(("d" "default" entry
      "* %?"
      :target (file+head "%<%Y-%m-%d>.org"
                         "#+title: %<%Y-%m-%d>\n"))))
  :config
  (setq org-startup-folded t
        org-startup-indented t
        org-startup-with-inline-images t
        org-startup-with-latex-preview t
        org-M-RET-may-split-line       t)

  ;; behaviors
  (setq org-export-html-postamble          nil
        org-hide-emphasis-markers          t
        org-html-validation-link           nil
        org-log-done                       nil
        org-outline-path-complete-in-steps nil
        org-return-follows-link            t
        org-src-window-setup               'current-window
        org-use-fast-todo-selection        t
        org-use-sub-superscripts           "{}")

  ;; refiling
  (setq org-refile-use-cache                   t ;; use C-0 C-c C-w to clear cache
        org-refile-use-outline-path            t
        org-refile-allow-creating-parent-nodes t
        org-refile-targets                     '((nil :maxlevel . 5)
                                                 (org-agenda-files :maxlevel . 5)))
  ;; todo
  (setq org-todo-keywords
        '((sequence "TODO(t)" "WIP(w)" "WAIT(a)" "PAUSE(p)" "|" "DONE(d)" "KILL(k)" "ASSIGNED(a)")))

  ;; tags
  (setq org-tag-alist
        '((:startgrouptag)
          ("study"      . ?s)
          (:grouptags)
          ("book"       . ?b)
          ("paper"      . ?a)
          (:endgrouptag)
          (:startgrouptag)
          ("work"       . ?w)
          ("personal"   . ?m)
          ("FLAGGED"    . ?f)))

  ;; clock in/out
  (setq org-clock-persist-file
        (expand-file-name "etc/org-clock-save.el" doom-cache-dir))

  ;; capture
  (setq +org-capture-changelog-file "changelog.org"
        +org-capture-notes-file     "notes.org"
        +org-capture-projects-file  "projects.org"
        +org-capture-todo-file      "todo.org"
        +org-capture-journal-file   "journal.org"
        org-capture-templates
        `(("t" "Todo" entry (file+headline "todo.org" "Todos")
           "* TODO %^{Task} %^G")))
  (map!
   (:map org-mode-map
    :desc "org markup"
    :prefix ("C-, o" . "org markup word")
    :desc "bold"          "b" #'custom/org-bold-word
    :desc "code"          "c" #'custom/org-code-word
    :desc "italics"       "i" #'custom/org-italicize-word
    :desc "strikethrough" "s" #'custom/org-strike-word
    :desc "underline"     "u" #'custom/org-underline-word
    :desc "verbatim"      "v" #'custom/org-verbatim-word)))

(use-package! consult-org-roam
   :defer t
   :after org
   :init
   (require 'consult-org-roam)
   (consult-org-roam-mode 1)
   :custom
   (consult-org-roam-grep-func #'consult-ripgrep)
   ;; Configure a custom narrow key for `consult-buffer'
   (consult-org-roam-buffer-narrow-key ?r)
   ;; Display org-roam buffers right after non-org-roam buffers
   ;; in consult-buffer (and not down at the bottom)
   (consult-org-roam-buffer-after-buffers t)
   :config
   ;; Eventually suppress previewing for certain functions
   (consult-customize
    consult-org-roam-forward-links
    :preview-key (kbd "M-."))
   ;; Define some convenient keybindings as an addition
   :bind
   ("C-c n r o f" . consult-org-roam-file-find)
   ("C-c n r o b" . consult-org-roam-backlinks)
   ("C-c n r o l" . consult-org-roam-forward-links)
   ("C-c n r o s" . consult-org-roam-search)
   ("C-c n r c"   . custom/org-rebuild-cache))
    #+end_src


#+RESULTS:
| org-tempo-setup | org-zotxt-mode | org-glossary-mode | org-ai-mode | +lookup--init-org-mode-handlers-h | (closure ((hook . org-mode-hook) (--dolist-tail--) t) (&rest _) (add-hook 'before-save-hook 'org-encrypt-entries nil t)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-modern-mode | org-auto-tangle-mode | doom-disable-show-paren-mode-h | doom-disable-show-trailing-whitespace-h | +org-make-last-point-visible-h | toc-org-enable | org-cdlatex-mode | org-eldoc-load | +literate-enable-recompile-h | (lambda (&rest _) #'(lambda nil (setq left-margin-width 2 right-margin-width 2))) |

(Disabled) Use svg-tag-mode to beautify org-mode tags, deadlines, and todos.

#+begin_src elisp
;; disabled
(when nil
  (defconst date-re "[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}")
  (defconst time-re "[0-9]\\{2\\}:[0-9]\\{2\\}")
  (defconst day-re "[A-Za-z]\\{3\\}")
  (defconst day-time-re (format "\\(%s\\)? ?\\(%s\\)?" day-re time-re))

  (defun svg-progress-percent (value)
    (svg-image (svg-lib-concat
                (svg-lib-progress-bar (/ (string-to-number value) 100.0)
                                      nil :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                (svg-lib-tag (concat value "%")
                             nil :stroke 0 :margin 0)) :ascent 'center))

  (defun svg-progress-count (value)
    (let* ((seq (mapcar #'string-to-number (split-string value "/")))
           (count (float (car seq)))
           (total (float (cadr seq))))
      (svg-image (svg-lib-concat
                  (svg-lib-progress-bar (/ count total) nil
                                        :margin 0 :stroke 2 :radius 3 :padding 2 :width 11)
                  (svg-lib-tag value nil
                               :stroke 0 :margin 0)) :ascent 'center)))

  (use-package! svg-tag-mode
    :hook ((org-agenda-mode org-super-agenda-mode). svg-tag-mode)
    :config
    (setq svg-tag-tags
          `(
            ;; Org tags
            (":\\([A-Za-z0-9]+\\)" . ((lambda (tag)
                                        (svg-tag-make tag :face 'org-modern-tag
                                                      :padding 1 :radius 3))))
            (":\\([A-Za-z0-9]+[ \-]\\)" . ((lambda (tag) tag)))

            ;; Task priority
            ("\\[#[A-Z]\\]" . ( (lambda (tag)
                                  (svg-tag-make tag :radius 8 :beg 2 :end -1 :margin 0))))

            ;; Progress
            ("\\(\\[[0-9]\\{1,3\\}%\\]\\)" . ((lambda (tag)
                                                (svg-progress-percent (substring tag 1 -2)))))

            ("\\(\\[[0-9]+/[0-9]+\\]\\)" . ((lambda (tag)
                                              (svg-progress-count (substring tag 1 -1)))))

            ;; Task Statuses
            ("TODO" . ((lambda (tag)
                         (svg-tag-make "TODO" :face 'org-modern-todo
                                       :inverse t :margin 0 :radius 8))))
            ("WIP" . ((lambda (tag)
                        (svg-tag-make "WIP"
                                      :face 'org-modern-todo
                                      :inverse nil :margin 0 :radius 8))))
            ("WAIT" . ((lambda (tag)
                         (svg-tag-make "WAIT"
                                       :face 'pulsar-yellow
                                       :inverse nil :margin 0 :radius 8))))
            ("HOLD" . ((lambda (tag)
                         (svg-tag-make "HOLD"
                                       :face 'pulsar-yellow
                                       :inverse t :margin 0 :radius 8))))
            ("DONE" . ((lambda (tag)
                         (svg-tag-make "DONE"
                                       :face 'org-modern-done
                                       :inverse nil :margin 0 :radius 8))))

            ;; Citation of the form [cite:@Knuth:1984]
            ("\\(\\[cite:@[A-Za-z]+:\\)" . ((lambda (tag)
                                              (svg-tag-make tag
                                                            :inverse t
                                                            :beg 7 :end -1
                                                            :crop-right t))))
            ("\\[cite:@[A-Za-z]+:\\([0-9]+\\]\\)" . ((lambda (tag)
                                                       (svg-tag-make tag
                                                                     :end -1
                                                                     :crop-left t))))


            ;; Active date (with or without day name, with or without time)
            (,(format "\\(<%s>\\)" date-re) .
             ((lambda (tag)
                (svg-tag-make tag
                              :face 'org-modern-date-active
                              :inverse t :beg 1 :end -1 :margin 0))))

            (,(format "\\(<%s \\)%s>" date-re day-time-re) .
             ((lambda (tag)
                (svg-tag-make tag
                              :face 'org-modern-date-active
                              :beg 1 :inverse t :crop-right t :margin 0))))
            (,(format "<%s \\(%s>\\)" date-re day-time-re) .
             ((lambda (tag)
                (svg-tag-make tag
                              :face 'org-modern-time-active
                              :end -1 :inverse t :crop-left t :margin 0))))

            ;; Inactive date  (with or without day name, with or without time)
            (,(format "\\(\\[%s\\]\\)" date-re) .
             ((lambda (tag)
                (svg-tag-make tag
                              :face 'org-modern-date-inactive
                              :beg 1 :end -1 :inverse t :margin 0 :face))))
            (,(format "\\(\\[%s \\)%s\\]" date-re day-time-re) .
             ((lambda (tag)
                (svg-tag-make tag
                              :face 'org-modern-date-inactive
                              :beg 1 :inverse t :crop-right t :margin 0))))
            (,(format "\\[%s \\(%s\\]\\)" date-re day-time-re) .
             ((lambda (tag)
                (svg-tag-make tag
                              :face 'org-modern-time-inactive
                              :end -1 :inverse t :crop-left t :margin 0))))))))
#+end_src
